# Pandas

In [1]:
# Pandas is a open-source library in python .

In [2]:
import pandas as pd 
# !pip install pandas

In [3]:
# Q.1 How to create a DataFrame using Dictionary ?

In [4]:
a = {
    "Name" : ['Mohit' , 'Rahul' , 'Kriti' , 'Purvi' , 'Suman' , 'Akhshra'],
    "Department":['Sales','Management','HR','HR','Sales','Management'] ,
    "Salary" : [20000,30000,40000,25000,15000,35000]
}

In [5]:
a

{'Name': ['Mohit', 'Rahul', 'Kriti', 'Purvi', 'Suman', 'Akhshra'],
 'Department': ['Sales', 'Management', 'HR', 'HR', 'Sales', 'Management'],
 'Salary': [20000, 30000, 40000, 25000, 15000, 35000]}

In [6]:
df = pd.DataFrame(a)
df

      Name  Department  Salary
0    Mohit       Sales   20000
1    Rahul  Management   30000
2    Kriti          HR   40000
3    Purvi          HR   25000
4    Suman       Sales   15000
5  Akhshra  Management   35000

In [7]:
# How to check top 5 data in a dataframe ?

In [8]:
df.head()

    Name  Department  Salary
0  Mohit       Sales   20000
1  Rahul  Management   30000
2  Kriti          HR   40000
3  Purvi          HR   25000
4  Suman       Sales   15000

In [9]:
df.head(2)

    Name  Department  Salary
0  Mohit       Sales   20000
1  Rahul  Management   30000

In [10]:
df.head(3)

    Name  Department  Salary
0  Mohit       Sales   20000
1  Rahul  Management   30000
2  Kriti          HR   40000

In [11]:
# How to check bottom 5 datas ?

In [12]:
df.tail()

      Name  Department  Salary
1    Rahul  Management   30000
2    Kriti          HR   40000
3    Purvi          HR   25000
4    Suman       Sales   15000
5  Akhshra  Management   35000

In [13]:
df.tail(2)

      Name  Department  Salary
4    Suman       Sales   15000
5  Akhshra  Management   35000

In [14]:
df.tail(3)

      Name  Department  Salary
3    Purvi          HR   25000
4    Suman       Sales   15000
5  Akhshra  Management   35000

In [15]:
# How to check random data ?

In [16]:
df.sample()

    Name Department  Salary
4  Suman      Sales   15000

In [17]:
df.sample(4)

      Name  Department  Salary
0    Mohit       Sales   20000
5  Akhshra  Management   35000
3    Purvi          HR   25000
2    Kriti          HR   40000

In [18]:
# How to save our data in excel ? 

# df.to_csv('EmpDepartmentsalary.csv')
df.to_csv('EmpDepartmentsalary.csv' , index = False)

# Describe() ==> Describe() is used for viewing statical structure of a dataframe .

In [19]:
df.describe()

             Salary
count      6.000000
mean   27500.000000
std     9354.143467
min    15000.000000
25%    21250.000000
50%    27500.000000
75%    33750.000000
max    40000.000000

In [20]:
df['Working_Hours'] = [4,5,3,4,5,5]

In [21]:
df

      Name  Department  Salary  Working_Hours
0    Mohit       Sales   20000              4
1    Rahul  Management   30000              5
2    Kriti          HR   40000              3
3    Purvi          HR   25000              4
4    Suman       Sales   15000              5
5  Akhshra  Management   35000              5

In [22]:
df['Name']

0      Mohit
1      Rahul
2      Kriti
3      Purvi
4      Suman
5    Akhshra
Name: Name, dtype: object

In [23]:
df['Department']

0         Sales
1    Management
2            HR
3            HR
4         Sales
5    Management
Name: Department, dtype: object

In [24]:
df['Salary']

0    20000
1    30000
2    40000
3    25000
4    15000
5    35000
Name: Salary, dtype: int64

In [25]:
df['Working_Hours']

0    4
1    5
2    3
3    4
4    5
5    5
Name: Working_Hours, dtype: int64

In [26]:
df['Salary'][2] = 32000

C:\Users\saurabh\AppData\Local\Temp\ipykernel_12948\627838235.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary'][2] = 32000

In [27]:
df

      Name  Department  Salary  Working_Hours
0    Mohit       Sales   20000              4
1    Rahul  Management   30000              5
2    Kriti          HR   32000              3
3    Purvi          HR   25000              4
4    Suman       Sales   15000              5
5  Akhshra  Management   35000              5

In [28]:
df['Name'][4] = 'Rohit'

C:\Users\saurabh\AppData\Local\Temp\ipykernel_12948\2352628335.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][4] = 'Rohit'

In [29]:
df

      Name  Department  Salary  Working_Hours
0    Mohit       Sales   20000              4
1    Rahul  Management   30000              5
2    Kriti          HR   32000              3
3    Purvi          HR   25000              4
4    Rohit       Sales   15000              5
5  Akhshra  Management   35000              5

In [30]:
# Rahul ==> Rubi , Akshshra department ==> Sales  , Purvi  working hours = 5 ?

In [31]:
df1 = df.copy()

In [32]:
df1

      Name  Department  Salary  Working_Hours
0    Mohit       Sales   20000              4
1    Rahul  Management   30000              5
2    Kriti          HR   32000              3
3    Purvi          HR   25000              4
4    Rohit       Sales   15000              5
5  Akhshra  Management   35000              5

In [33]:
df.dtypes

Name             object
Department       object
Salary            int64
Working_Hours     int64
dtype: object

# Pandas Data Structure : 
#     1. Series  
#     2. DataFrame

# 1. Series ==> It is one dimensional array with indexes . It stores a single column or row of data .

In [34]:
import numpy as np 
p = np.arange(1,5)
a = pd.Series(p)
a

0    1
1    2
2    3
3    4
dtype: int32

In [35]:
type(a)

pandas.core.series.Series

In [36]:
# 2. Data Frame ==> It is like a tabular spreadsheet structure and it has one and multi-dimensional data . 

d = pd.DataFrame(np.random.rand(100,6))
d

           0         1         2         3         4         5
0   0.011077  0.755378  0.440871  0.709036  0.363501  0.333562
1   0.741911  0.243085  0.157460  0.240039  0.844708  0.706317
2   0.063769  0.662591  0.845647  0.943397  0.868501  0.071915
3   0.418957  0.716396  0.030687  0.992601  0.136312  0.705159
4   0.067584  0.693073  0.053416  0.179815  0.652338  0.281197
..       ...       ...       ...       ...       ...       ...
95  0.615462  0.082807  0.336596  0.571337  0.971046  0.459167
96  0.975706  0.853596  0.366292  0.742877  0.685941  0.257141
97  0.768835  0.673324  0.871378  0.790940  0.581044  0.714965
98  0.096560  0.286868  0.211082  0.772618  0.356853  0.630120
99  0.879020  0.501498  0.108223  0.338277  0.003967  0.324762

[100 rows x 6 columns]

In [37]:
type(d)

pandas.core.frame.DataFrame

In [38]:
d.columns = list("ABCDEF")  # how to rename a dataframe

In [39]:
df = d

In [40]:
df

           A         B         C         D         E         F
0   0.011077  0.755378  0.440871  0.709036  0.363501  0.333562
1   0.741911  0.243085  0.157460  0.240039  0.844708  0.706317
2   0.063769  0.662591  0.845647  0.943397  0.868501  0.071915
3   0.418957  0.716396  0.030687  0.992601  0.136312  0.705159
4   0.067584  0.693073  0.053416  0.179815  0.652338  0.281197
..       ...       ...       ...       ...       ...       ...
95  0.615462  0.082807  0.336596  0.571337  0.971046  0.459167
96  0.975706  0.853596  0.366292  0.742877  0.685941  0.257141
97  0.768835  0.673324  0.871378  0.790940  0.581044  0.714965
98  0.096560  0.286868  0.211082  0.772618  0.356853  0.630120
99  0.879020  0.501498  0.108223  0.338277  0.003967  0.324762

[100 rows x 6 columns]

In [41]:
df.describe()

                A           B           C           D           E           F
count  100.000000  100.000000  100.000000  100.000000  100.000000  100.000000
mean     0.444032    0.532465    0.483465    0.484482    0.478083    0.533918
std      0.286428    0.303164    0.300273    0.298187    0.304781    0.280716
min      0.005763    0.025047    0.007765    0.001526    0.003967    0.004910
25%      0.205411    0.275922    0.207228    0.195131    0.196655    0.308653
50%      0.430407    0.523013    0.479734    0.483455    0.499811    0.566137
75%      0.661489    0.820209    0.792996    0.743976    0.740545    0.742687
max      0.979393    0.995558    0.971355    0.998288    0.992212    0.989040

In [42]:
# top 5 data 
df.head()

          A         B         C         D         E         F
0  0.011077  0.755378  0.440871  0.709036  0.363501  0.333562
1  0.741911  0.243085  0.157460  0.240039  0.844708  0.706317
2  0.063769  0.662591  0.845647  0.943397  0.868501  0.071915
3  0.418957  0.716396  0.030687  0.992601  0.136312  0.705159
4  0.067584  0.693073  0.053416  0.179815  0.652338  0.281197

In [43]:
# bottom 5 data 
df.tail()

           A         B         C         D         E         F
95  0.615462  0.082807  0.336596  0.571337  0.971046  0.459167
96  0.975706  0.853596  0.366292  0.742877  0.685941  0.257141
97  0.768835  0.673324  0.871378  0.790940  0.581044  0.714965
98  0.096560  0.286868  0.211082  0.772618  0.356853  0.630120
99  0.879020  0.501498  0.108223  0.338277  0.003967  0.324762

In [44]:
df['A'][1] = 55555

In [45]:
df.head(2)

              A         B         C         D         E         F
0      0.011077  0.755378  0.440871  0.709036  0.363501  0.333562
1  55555.000000  0.243085  0.157460  0.240039  0.844708  0.706317

In [46]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
F    float64
dtype: object

In [47]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [48]:
a = {
    "Name" : ['Mohit' , 'Rahul' , 'Kriti' , 'Purvi' , 'Suman' , 'Akhshra'],
    "Department":['Sales','Management','HR','HR','Sales','Management'] ,
    "Salary" : [20000,30000,40000,25000,15000,35000]
}

In [50]:
df = pd.DataFrame(a) 
df['working_hours'] = [5,5,4,3,2,5]

In [51]:
df

      Name  Department  Salary  working_hours
0    Mohit       Sales   20000              5
1    Rahul  Management   30000              5
2    Kriti          HR   40000              4
3    Purvi          HR   25000              3
4    Suman       Sales   15000              2
5  Akhshra  Management   35000              5

In [52]:
# If we want to convert our data frame into numpy array then we use df.to_numpy() 

df.to_numpy()

array([['Mohit', 'Sales', 20000, 5],
       ['Rahul', 'Management', 30000, 5],
       ['Kriti', 'HR', 40000, 4],
       ['Purvi', 'HR', 25000, 3],
       ['Suman', 'Sales', 15000, 2],
       ['Akhshra', 'Management', 35000, 5]], dtype=object)

In [53]:
# How to transpose our data  

# Transpose ==> row* column ==> column*row

In [55]:
df.T

                   0           1      2      3      4           5
Name           Mohit       Rahul  Kriti  Purvi  Suman     Akhshra
Department     Sales  Management     HR     HR  Sales  Management
Salary         20000       30000  40000  25000  15000       35000
working_hours      5           5      4      3      2           5

In [58]:
df.T.T

      Name  Department Salary working_hours
0    Mohit       Sales  20000             5
1    Rahul  Management  30000             5
2    Kriti          HR  40000             4
3    Purvi          HR  25000             3
4    Suman       Sales  15000             2
5  Akhshra  Management  35000             5

In [59]:
df

      Name  Department  Salary  working_hours
0    Mohit       Sales   20000              5
1    Rahul  Management   30000              5
2    Kriti          HR   40000              4
3    Purvi          HR   25000              3
4    Suman       Sales   15000              2
5  Akhshra  Management   35000              5

In [60]:
#loc and iloc 

# loc ==> [row_idex , column_name] 
# iloc ==> [row_index , column_index]

In [64]:
df.loc[2 , "Name"] = "Naisha"

In [65]:
df

      Name  Department  Salary  working_hours
0    Mohit       Sales   20000              5
1    Rahul  Management   30000              5
2   Naisha          HR   40000              4
3    Purvi          HR   25000              3
4    Suman       Sales   15000              2
5  Akhshra  Management   35000              5

In [70]:
df.loc[2:5 , ["Name" , "Salary"]]

      Name  Salary
2   Naisha   40000
3    Purvi   25000
4    Suman   15000
5  Akhshra   35000

In [73]:
df.iloc[2 , 0]

'Naisha'